&АннотацияБезПараметра
&АннотацияСПараметром("Значение")
&АннотацияСИменованнымПараметром(ИмяПараметра = "Значение")
Перем Поле Экспорт;

&АннотацияБезПараметра
&АннотацияСПараметром("Значение")
&АннотацияСИменованнымПараметром(ИмяПараметра = "Значение")
Функция ТестоваяФункция() Экспорт
	Возврат 1;
КонецФункции

Функция ТестоваяФункцияСоЗначениемПараметраПоУмолчанию(Парам = 1) Экспорт
	Возврат Парам;
КонецФункции

Процедура ИзменитьЗначениеПоля(&АннотацияБезПараметра &АннотацияСПараметром("Значение") &АннотацияСИменованнымПараметром(ИмяПараметра = "Значение") НовоеЗначение) Экспорт
	Поле = НовоеЗначение;
КонецПроцедуры

Функция ВернутьЭтотОбъект() Экспорт
	Возврат ЭтотОбъект;
КонецФункции
