&АннотацияБезПараметра
&АннотацияСПараметром("Значение")
&АннотацияСИменованнымПараметром(ИмяПараметра = "Значение")
Перем Поле Экспорт;

&АннотацияБезПараметра
&АннотацияСПараметром("Значение")
&АннотацияСИменованнымПараметром(ИмяПараметра = "Значение")
Перем ПриватноеПоле;

&АннотацияБезПараметра
&АннотацияСПараметром("Значение")
&АннотацияСИменованнымПараметром(ИмяПараметра = "Значение")
Функция ТестоваяФункция() Экспорт
	Возврат 1;
КонецФункции

&АннотацияБезПараметра
&АннотацияСПараметром("Значение")
&АннотацияСИменованнымПараметром(ИмяПараметра = "Значение")
Процедура ТестоваяПроцедура() Экспорт
	Поле = "ЯТестоваяПроцедураЯВыполнился";
КонецПроцедуры

Функция ТестоваяФункцияСоЗначениемПараметраПоУмолчанию(Парам = 1) Экспорт
	Возврат Парам;
КонецФункции

Процедура ИзменитьЗначениеПоля(&АннотацияБезПараметра &АннотацияСПараметром("Значение") &АннотацияСИменованнымПараметром(ИмяПараметра = "Значение") НовоеЗначение) Экспорт
	Поле = НовоеЗначение;
КонецПроцедуры

Процедура ИзменитьЗначениеПриватногоПоля(НовоеЗначение) Экспорт
	ПриватноеПоле = НовоеЗначение;
КонецПроцедуры

Функция ВернутьЭтотОбъект() Экспорт
	Возврат ЭтотОбъект;
КонецФункции
